{
  "sections": [
    {
      "id": "1",
      "title": {
        "text1": "تعاریف اولیۀ",
        "text2": "بیرگرم"
      },
      "content": [
        {
          "label": "بیرگرم",
          "text": "برگرفته از عبارت «میلی گرم طلا» و نشان‌دهنده تعهد شرکت به تحویل یک میلی‌گرم (یک هزارم گرم) طلای ۱۸ عیار (عیار ۷۵۰) یا معادل آن با عیار دیگر به دارنده هر بیرگرم است. معادل‌سازی طلای تحویلی به کاربر با استفاده از فرمول زیر انجام می‌شود:"
        },
        {
          "type": "formula",
          "formula": "وزن طلای تحویلی به گرم = ۷۵۰/۱۰۰۰ / تعداد بیرگرم * عیار تحویلی"
        },
        {
          "label": "مثال",
          "text": "سامانه با رعایت رویه ذکر شده در بخش قوانین تحویل طلا، به دارنده هر ۴۰۰۰ بیرگرم، ۴ گرم طلای ۱۸ عیار یا معادل آن یعنی ۳ گرم طلای ۲۴ عیار، تحویل می‌دهد."
        },
        {
          "label": "۱- سامانه بیرگرم",
          "text": "بستر نرم افزاری خرید و فروش و تبادل بیرگرم بر اساس شرایط و ضوابط مندرج در این موافقت نامه است."
        },
        {
          "label": "۲- سامانه",
          "text": "در این موافقت‌نامه حسب مورد به سامانه بیرگرم یا سایر سامانه‌های متعلق به شرکت که خدمات موضوع موافقت‌نامه حاضر بر بستر آن‌ها ارائه می‌شوند اطلاق می‌شود ."
        },
        {
          "label": "۳- شرکت",
          "text": "منظور شرکت سرمایه زرین ماندگار به شناسه ملی ۱۴۰۱۱۷۴۵۱۹۱ و شماره ثبت ۶۰۵۹۸۷، به عنوان طرف قرارداد کاربر و مالک سامانه بیرگرم است."
        },
        {
          "label": "۴- کاربر",
          "text": "شخصی حقیقی یا حقوقی که با افتتاح حساب کاربری در سامانه و پذیرش این موافقتنامه به سامانه متصل می‌شود و از خدمات آن استفاده می‌کند."
        }
      ]
    },
    {
      "id": "2",
      "title": {
        "text1": "قوانین و تعهدات تغییرناپذیر سامانه",
        "text2": "بیرگرم"
      },
      "content": [
        {
          "label": "1-",
          "text": "همواره معادل مجموع موجودی بیرگرم کاربران سامانه، طلا به صورت فیزیکی در خزانه بیرگرم نگهداری می‎شود. از لحظه خرید کاربران تا زمان تحویل طلای معادل بیرگرم خریداری شده، مسئولیت حفظ و نگهداری این میزان طلا، بر عهده سامانه است. طلای معادل بیرگرم، در تعریف بیرگرم توضیح داده شده است."
        },
        {
          "label": "2-",
          "text": "شرکت همواره متعهد است پس از درخواست کاربر مبنی بر دریافت طلای معادل موجودی بیرگرم، طلای معادل را به کاربر تحویل دهد."
        },
        {
          "label": "3-",
          "text": "سامانه ملزم است در صورت ثبت درخواست برداشت وجه، پس از استعلام حساب بانکی، وجه را حداکثر ظرف ۳ روز کاری به حساب کاربر به صورت ساتنا و پایا منتقل نماید."
        }
      ]
    },
    {
      "id": "3",
      "title": {
        "text1": "حقوق و تعهدات سامانه",
        "text2": "بیرگرم"
      },
      "content": [
        {
          "label": "1-",
          "text": "همواره معادل مجموع موجودی بیرگرم کاربران سامانه، طلا به صورت فیزیکی در خزانه بیرگرم نگهداری می‎شود."
        },
        {
          "label": "2-",
          "text": "با توجه به قوانین و مقررات جاری کشور و شرایط مختلف، سامانه می‌تواند برای خرید و فروش بیرگرم توسط کاربران، محدودیت‌هایی از قبیل سقف خرید و فروش و… تعیین کند."
        },
        {
          "label": "3-",
          "text": "هم‌زمان با انجام هرگونه عملیات اعم از خرید، فروش، برداشت از حساب، معامله، انتقال یا ثبت درخواست تحویل طلا، تمامی کارمزدهای سامانه دریافت می‌گردد."
        }
      ]
    },
    {
      "id": "4",
      "title": {
        "text1": "کارمزد خدمات",
        "text2": "بیرگرم"
      },
      "content": [
        {
          "label": "1-",
          "text": "سامانه در ازای هر معامله (اعم از خرید یا فروش) کارمزد خدمات خود را محاسبه و از طرفین معامله دریافت می‌نماید."
        },
        {
          "label": "2-",
          "text": "هنگام تحویل طلا، به ازای میزان طلای درخواستی، کارمزد تحویل و همچنین بر اساس نوع طلای تحویلی به کاربر، کارمزد ضرب و یا فرآوری، از کاربران دریافت خواهد شد."
        },
        {
          "label": "3-",
          "text": "تعرفه کارمزدهای تمامی خدمات سامانه در صفحه کارمزدها درج و به‌طور مستمر به‌روزرسانی می‌شود که کاربران می‌بایست به طور مستمر کارمزد تعرفه‌ها را بررسی نمایند."
        }
      ]
    }
  ]
}
