'use client'
import React, { useEffect, useState } from "react";
import { ScrollShadow } from "@nextui-org/react";
import axios from "axios";
import Config from "../config";



function AboutUs() {
  const [data, setData] = useState(false);
  const serverdata = async () => {
    try {
      const res = await axios.get(`${Config.apiUrl}/splash`);
      if (res.data.code === 1) {
        setData(res.data.options);
      }
    } catch (error) {
      console.error("Error fetching data:", error);
    }
  };
  useEffect(() => {
    serverdata();
  }, [])
  return (
    data ?
      <div className="bg-white">
        <article className="container mx-auto sm:py-20 py-5 flex flex-col gap-3">
          <h1 className="text-gray-700 text-xl text-center">درباره بیرگرم</h1>
          <ScrollShadow hideScrollBar className="w-full h-[300px] text-gray-400 text-sm leading-6">
          <div dangerouslySetInnerHTML={{ __html: data?.description }} />
            
            {/* <p>
              همه ما به دنبال راه‌هایی برای سرمایه‌گذاری مطمئن و کم‌ریسک هستیم و
              طلا، علاوه بر زیبایی و کاربرد زینتی، همیشه به عنوان یک سرمایه امن و
              سپر محکمی در برابر تورم شناخته شده است. به همین دلیل، طلا در ایران
              جایگاه ویژه‌ای در سبد سرمایه‌گذاری و پس‌انداز مردم دارد. با وجود
              پیشرفت تکنولوژی و گسترش بازارهای آنلاین، در چنین شرایطی نیاز به یک
              پلتفرم آنلاین، امن و در دسترس برای مشاهده قیمت و خرید و فروش طلا به
              شدت احساس می‌شود. پلتفرمی معتبر که بتوان در آن با خیال راحت و تنها
              با چند کلیک، خرید و فروش طلا انجام داد. بیرگرم گلد با فراهم کردن
              امکان خرید و فروش آسان طلای آب‌شده، به شما کمک می‌کند تا در برابر
              نوسانات بازار و کاهش ارزش پول، از سرمایه خود محافظت کنید و قدرت
              خریدتان را افزایش دهید. در بیرگرم گلد می‌توانید به هر میزان که
              مایلید طلای آب‌شده خریداری کنید و یا طلای خود را به بیرگرم بفروشید.
              همچنین می‌توانید به راحتی و به صورت آنی، طلا را به دیگران انتقال
              دهید یا به عنوان هدیه ارسال کنید.
            </p>
            <h6 className="font-semibold text-gray-400">
              بیرگرم، سایت رسمی خرید و فروش طلای آب شده
            </h6>
            <p>
              خرید و فروش طلای آب‌شده در بازار سنتی با چالش‌های زیادی همراه است.
              نیاز به سرمایه زیاد، شناخت فروشنده معتبر، ضامن و مراجعه حضوری به
              بازار طلا از جمله این مشکلات هستند. همچنین، طلای خریداری شده از
              بازار معمولا فاقد شماره انگ و فاکتور است و ریسک تقلب در آن بالاست.
              اما در میلی‌گلد، شما می‌توانید به راحتی و با امنیت کامل، طلای آب‌شده
              را به صورت آنلاین خرید و فروش کنید. تمام طلاهای موجود در میلی‌گلد در
              آزمایشگاه‌های معتبر عیارسنجی شده و دارای کد انگ هستند تا از اصالت
              آنها مطمئن باشید. همچنین می‌توانید طلای خریداری شده را به صورت
              فیزیکی تحویل بگیرید یا در پلتفرم میلی بفروشید و به سرعت وجه آن را
              دریافت کنید. این عوامل میلی گلد را به بهترین سایت خرید طلای آب شده
              تبدیل می‌کند.
            </p>
            <h6 className="font-semibold text-gray-400">
              چرا طلای آب‌شده را از بیرگرم بخریم؟
            </h6>
            <p>
              میلی گلد یک پلتفرم خرید و فروش آنلاین طلا است که به کاربران امکان
              می‌دهد طلای آب شده ۱۸ عیار ۷۵۰ را به صورت آنلاین و بدون اجرت خریداری
              یا بفروشند. این طلا را می‌توانید در حساب دیجیتالی خود ذخیره کرده یا
              به‌صورت فیزیکی تحویل بگیرید. میلی، بهترین پلتفرم خرید طلای آب شده،
              با ارائه خدمات امن و سریع، به کاربران کمک می‌کند تا سرمایه‌گذاری خود
              را به راحتی مدیریت کنند. به طور خلاصه مزایای خرید طلا از میلی گلد
              عبارتند از:
            </p>
            <ul className="list-disc list-inside">
              <li>
                عدم نیاز به سرمایه بالا: در میلی، با هر میزان سرمایه، حتی مبالغ
                کم، می‌توانید به راحتی طلا خرید و فروش کنید.
              </li>
              <li>
                عقیمت منصفانه: خرید و فروش طلا در میلی گلد بدون اجرت و با قیمت
                طلای آب شده لحظه‌ای انجام می‌شود. همچنین برای خرید طلا در میلی
                نیاز به پرداخت مالیات نیست.
              </li>
              <li>
                مناسب سرمایه‌گذاری کوتاه مدت: در میلی، خرید و فروش طلا به صورت
                آنی انجام می‌شود. به همین دلیل، میلی برای سرمایه‌گذاری‌های
                کوتاه‌مدت هم گزینه مناسبی است.
              </li>
              <li>
                امنیت بالا: میلی از پروتکل‌های امنیتی پیشرفته برای حفاظت از
                اطلاعات و دارایی‌های شما استفاده می‌کند و دارای مجوزهای لازم از
                مراجع ذی‌صلاح است.
              </li>
              <li>
                عدم نیاز به نگهداری: خرید طلا در میلی کاملا امن است و هیچ نگرانی
                از بابت سرقت یا هزینه نگهداری نخواهید داشت.
              </li>
              <li>
                سرعت در معاملات: میلی با ارائه خدماتی مانند خرید اینترنتی طلای
                آبشده، به شما امکان می‌دهد تا به سرعت معاملات خود را انجام دهید.
                شما می‌توانید در هر ساعت شبانه روز در میلی طلا بخرید و بفروشید.
              </li>
              <li>
                شفافیت کامل: قیمت‌ها و شرایط معاملات به صورت شفاف در سایت ارائه
                می‌شود. همچنین با استفاده از محاسبه‌گر میلی گلد می‌توانید مبلغ
                طلای مورد نظر خود را محاسبه کنید.
              </li>
              <li>
                پشتیبانی همه‌جانبه: میلی دارای تیم پشتیبانی است که در صورت بروز
                هرگونه مشکل یا سوال، به شما کمک می‌کند.
              </li>
            </ul> */}
          </ScrollShadow>
        </article>
      </div > : <div>loading...</div>
  )
}
export default AboutUs;
