// import { Accordion, AccordionItem, Divider } from "@nextui-org/react";
// import Image from "next/image";
// import Link from "next/link";
// import React from "react";

// function BirgeramRules() {
//   return (
//     <Accordion
//       variant="splitted"
//       itemClasses={{
//         indicator: "[&>svg]:rotate-180 rtl:rotate-90",
//         content: "pb-5",
//       }}
//     >
//       <AccordionItem
//         key="1"
//         aria-label="تعاریف اولیۀ بیرگرم"
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900">تعاریف اولیۀ </p>
//             <p className="text-yellow-400">بیرگرم </p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold">بیرگرم :</span>
//             <span>
//               برگرفته از عبارت «میلی گرم طلا» و نشان‌دهنده تعهد شرکت به تحویل یک
//               میلی‌گرم (یک هزارم گرم) طلای ۱۸ عیار (عیار ۷۵۰) یا معادل آن با
//               عیار دیگر به دارنده هر بیرگرم است. معادل‌سازی طلای تحویلی به کاربر
//               با استفاده از فرمول زیر انجام می‌شود:
//             </span>
//             <div className="bg-blue-100 text-blue-400 flex gap-3 p-3 rounded-lg mt-2">
//               <Image
//                 width={24}
//                 height={24}
//                 src={"/icons/rules/info.svg"}
//                 alt="info"
//               />
//               <p>
//                 وزن طلای تحویلی به گرم = ۷۵۰/۱۰۰۰ / تعداد بیرگرم * عیار تحویلی
//               </p>
//             </div>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">مثال :</span>
//             <span>
//               {" "}
//               سامانه با رعایت رویه ذکر شده در بخش قوانین تحویل طلا، به دارنده هر
//               ۴۰۰۰ بیرگرم، ۴ گرم طلای ۱۸ عیار یا معادل آن یعنی ۳ گرم طلای ۲۴
//               عیار، تحویل می‌دهد.
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">
//               ۱- سامانه بیرگرم :
//             </span>
//             <span>
//               {" "}
//               بستر نرم افزاری خرید و فروش و تبادل بیرگرم بر اساس شرایط و ضوابط
//               مندرج در این موافقت نامه است.
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">۲- سامانه :</span>
//             <span>
//               {" "}
//               در این موافقت‌نامه حسب مورد به سامانه بیرگرم یا سایر سامانه‌های
//               متعلق به شرکت که خدمات موضوع موافقت‌نامه حاضر بر بستر آن‌ها ارائه
//               می‌شوند اطلاق می‌شود .
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">۳- شرکت :</span>
//             <span>
//               {" "}
//               منظور شرکت سرمایه زرین ماندگار به شناسه ملی ۱۴۰۱۱۷۴۵۱۹۱ و شماره
//               ثبت ۶۰۵۹۸۷، به عنوان طرف قرارداد کاربر و مالک سامانه بیرگرم است.
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">۴- کاربر :</span>
//             <span>
//               {" "}
//               شخصی حقیقی یا حقوقی که با افتتاح حساب کاربری در سامانه و پذیرش این
//               موافقتنامه به سامانه متصل می‌شود و از خدمات آن استفاده می‌کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">
//               ۵- حساب کاربری :
//             </span>
//             <span>
//               {" "}
//               برای استفاده از خدمات سامانه، کاربران باید با تکمیل فرآیند ثبت
//               نام، نسبت به ایجاد حساب کاربری در سامانه اقدام کنند. هر شخص فقط یک
//               حساب کاربری می‌تواند داشته باشد. حساب کاربری شخص حقوقی، می‎تواند
//               به صورت یک حساب کاربری جداگانه به نام شخص حقوقی باشد و یا از طریق
//               حساب کاربری نماینده/نمایندگان معرفی شده از سوی شخص حقوقی در دسترس
//               قرار گیرد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">
//               ۶- حساب بیرگرم :
//             </span>
//             <span>
//               {" "}
//               منظور حساب کاربر نزد دفاتر الکترونیک سامانه است که کاربر می‌تواند
//               از طریق آن میزان خالص موجودی بیرگرم خود را مشاهده کند. هر کاربر
//               می‌تواند یک یا چند حساب بیرگرم در سامانه داشته باشد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">
//               ۷- کیف پول ریالی :
//             </span>
//             <span>
//               {" "}
//               منظور کیف پول الکترونیک کاربر در سامانه است که امکان شارژ آن از
//               طریق واریز وجه به حساب شرکت به وسیله درگاه پرداخت و یا سایر
//               ابزارهای بانکی وجود دارد و همچنین مبلغ ریالی حاصل از فروش بیرگرم،
//               به این کیف پول واریز می‌شود. کاربر امکان برداشت از این کیف پول و
//               انتقال وجه موجود در آن، به حساب بانکی خود را دارد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">۸- خدمات :</span>
//             <span>
//               {" "}
//               هر یک از قابلیت‌ها، امکانات و خدماتی که بر بستر یا توسط سامانه
//               میلی و یا شرکت در اختیار کاربران قرار می‌گیرد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">۹- دسترسی :</span>
//             <span>
//               {" "}
//               قابلیت استفاده خدمات ارائه شده توسط سامانه به موجب این موافقت‌نامه
//               برای کاربر{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">
//               ۱۰- اطلاعات شخصی :
//             </span>
//             <span>
//               {" "}
//               هر گونه اطلاعات متعلق به کاربر، از قبیل نشانی ایمیل، شماره تلفن
//               همراه، شماره ملی، شماره حساب بانکی و شماره شبا، که به تنهایی یا در
//               ترکیب با سایر اطلاعات برای شناسایی یک پروفایل، حساب کاربری یا سایر
//               قابلیت‌های اختصاص یافته به کاربر مورد استفاده قرار می‌گیرد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900">
//               ۱۱- موافقت‌نامه :
//             </span>
//             <span>
//               {" "}
//               منظور از موافقت‌نامه سند حاضر است که کاربر با ایجاد حساب کاربری
//               مفاد و تعهدات آن را پذیرفته و سامانه میلی صرفاً با التزام کاربر به
//               این تعهدات، خدمات خود را به کاربر ارائه مینماید. این موافقت‌نامه
//               الکترونیکی، مطابق قانون تجارت الکترونیکی بوده و با اعلام موافقت
//               الکترونیکی کاربر که در هنگام ایجاد حساب کاربری اخذ می‌شود، منعقد
//               شده و برای طرفین لازم‌الرعایه است. این موافقت‌نامه الحاقی است و
//               هرگونه تغییری در این موافقت‌نامه به تایید کاربر می‌رسد؛ در صورت
//               عدم پذیرش، کاربر باید فوراً استفاده از خدمات را متوقف کرده و نسبت
//               به لغو عضویت اقدام نماید.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="2"
//         aria-label="Accordion 2"
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900">
//               {" "}
//               قوانین و تعهدات تغییرناپذیر سامانه{" "}
//             </p>
//             <p className="text-yellow-400">بیرگرم </p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span>
//               {" "}
//               قوانین زیر، تعهدات اساسی شرکت به کاربران بیرگرم است و شرکت امکان
//               تغییر این تعهدات را از خود سلب می‌کند:{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               همواره معادل مجموع موجودی بیرگرم کاربران سامانه، طلا به صورت
//               فیزیکی در خزانه بیرگرم نگهداری می‎شود. از لحظه خرید کاربران تا
//               زمان تحویل طلای معادل بیرگرم خریداری شده، مسئولیت حفظ و نگهداری
//               این میزان طلا، بر عهده سامانه است. طلای معادل بیرگرم، در تعریف
//               بیرگرم توضیح داده شده است.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">2-</span>
//             <span>
//               {" "}
//               شرکت همواره متعهد است پس از درخواست کاربر مبنی بر دریافت طلای
//               معادل موجودی بیرگرم، طلای معادل را به کاربر تحویل دهد. محدودیت‎های
//               عملیاتی (مانند تعطیلات رسمی یا ساعت کاری) ممکن است در تحویل طلا
//               تاخیر ایجاد کند ولی محدودیت‎ها نباید به شکلی باشد که به منزله تعلل
//               یا امتناع شرکت از تحویل طلا به کاربر محسوب شود.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               سامانه ملزم است در صورت ثبت درخواست برداشت وجه، پس از استعلام حساب
//               بانکی، وجه را حداکثر ظرف ۳ روز کاری به حساب کاربر به صورت ساتنا و
//               پایا منتقل نماید.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="3"
//         aria-label="Accordion 3"
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900"> حقوق و تعهدات سامانه </p>
//             <p className="text-yellow-400">بیرگرم </p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               همواره معادل مجموع موجودی بیرگرم کاربران سامانه، طلا به صورت
//               فیزیکی در خزانه بیرگرم نگهداری می‎شود. از لحظه خرید کاربران تا
//               زمان تحویل طلای معادل بیرگرم خریداری شده، مسئولیت حفظ و نگهداری
//               این میزان طلا، بر عهده سامانه است. طلای معادل بیرگرم، در تعریف
//               بیرگرم توضیح داده شده است.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">2-</span>
//             <span>
//               {" "}
//               با توجه به قوانین و مقررات جاری کشور و شرایط مختلف، سامانه
//               می‌تواند برای خرید و فروش بیرگرم توسط کاربران، محدودیت‌هایی از
//               قبیل سقف خرید و فروش و… تعیین کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               هم‌زمان با انجام هرگونه عملیات اعم از خرید، فروش، برداشت از حساب،
//               معامله، انتقال یا ثبت درخواست تحویل طلا، تمامی کارمزدهای سامانه
//               دریافت می‌گردد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               سامانه ملزم است در صورت ثبت درخواست برداشت وجه، پس از استعلام حساب
//               بانکی، وجه را حداکثر ظرف ۳ روز کاری به حساب کاربر به صورت ساتنا یا
//               پایا منتقل نماید. برداشت مبالغ کمتر از ۱۰۰ هزار ريال امکان‌پذیر
//               نیست و انتقال وجه تنها به شماره حساب/شبا/کارت بانکی متعلق به کاربر
//               انجام می‌شود.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span>
//               {" "}
//               اگر اشتباهاً یا من غیر حق یا به جهت تداخل و مشکلات سیستمی، اعتبار
//               و یا دارایی‌ای در کیف پول کاربر منظور (افزوده یا کاسته) گردد،
//               سامانه می‌تواند بدون نیاز به اقدام قانونی یا قضایی نسبت به تصحیح
//               اشتباه و بازگرداندن وضعیت به حالت صحیح اقدام نماید. اقدامات سامانه
//               در راستای اصلاح اشتباهات مورد تایید کاربر بوده و از این جهت کاربر
//               مسئولیت و ادعایی را متوجه سامانه نخواهد کرد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">6-</span>
//             <span>
//               {" "}
//               در صورتی ‌که به‌ موجب دستور مقام قضائی و یا مرجع انتظامی
//               فعالیت‌های کاربر غیرقانونی اعلام گردد و یا دستور توقیف وصول شود،
//               حساب کاربری و حساب‎های بیرگرم مرتبط با آن، تعلیق و هرگونه فعالیت
//               کاربری و موجودی حساب بیرگرم و کیف پول کاربر تا تعیین تکلیف نهایی،
//               مسدود می‌گردد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">7-</span>
//             <span>
//               {" "}
//               سامانه بیرگرم یک سامانه آنلاین است که دستورات و سفارش‌های کاربران
//               را به نام و حساب آنان انجام می‌دهد و هیچ‌گونه عملیاتی را خارج از
//               حدود اختیار و دستورات کاربران انجام نمی‌دهد. کاربران اعلام و اذعان
//               می‌کنند رابطه سامانه با ایشان مشمول قوانین کار و تأمین اجتماعی یا
//               سایر قوانین و مقررات مرتبط با آن نیست.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">8-</span>
//             <span>
//               {" "}
//               با توجه به نوسانات احتمالی قیمت، خرید بیرگرم تنها پس از پرداخت،
//               نهایی می‌شود و ثبت درخواست خرید بیرگرم، تا پیش از پرداخت نهایی از
//               سوی کاربر، قطعی محسوب نمی‌گردد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">9-</span>
//             <span>
//               {" "}
//               شرکت هیچ‌گونه تعهدی در خصوص معاملات درخواست شده در خارج از سامانه،
//               ندارد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">10-</span>
//             <span>
//               {" "}
//               به تفکیک حساب‌های کاربران حقیقی و حقوقی در{" "}
//               <Link href={"#"} className="text-blue-500 hover:text-blue-900">
//                 {" "}
//                 صفحه محدودیت‌های تراکنش در بیرگرم
//               </Link>{" "}
//               آورده شده است.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="4"
//         aria-label=""
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900"> کارمزد خدمات </p>
//             <p className="text-yellow-400">بیرگرم </p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               سامانه در ازای هر معامله (اعم از خرید یا فروش) کارمزد خدمات خود را
//               محاسبه و از طرفین معامله دریافت می‌نماید. هنگام خرید بیرگرم،
//               کارمزد سامانه به مبلغ بیرگرم افزوده می‌گردد و هنگام فروش بیرگرم،
//               وجه حاصل از فروش، پس از کسر کارمزد سامانه به کیف پول ریالی کاربر
//               واریز می‌شود.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">2-</span>
//             <span>
//               {" "}
//               هنگام تحویل طلا، به ازای میزان طلای درخواستی، کارمزد تحویل و
//               همچنین بر اساس نوع طلای تحویلی به کاربر، کارمزد ضرب و یا فرآوری،
//               از کاربران دریافت خواهد شد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               تعرفه کارمزدهای تمامی خدمات سامانه در صفحه کارمزدها درج و به‌طور
//               مستمر به‌روزرسانی می‌شود که کاربران می‌بایست به طور مستمر کارمزد
//               تعرفه‌ها را بررسی نمایند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               کارمزدها صرفا از طریق سامانه دریافت می‌گردند و دریافت و پرداخت
//               هرگونه وجهی خارج از سامانه و تحت هر عنوان دیگری ارتباطی با سامانه
//               نداشته و مسئولیتی از این ‌جهت بر عهده سامانه نیست.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span>
//               {" "}
//               بیرگرم در دریافت کارمزد درگاه واریز و برداشت ریالی ذینفع نیست و
//               دریافت این مبلغ طبق قوانین مربوط به بانک مرکزی، درگاه پرداخت و
//               پرداخت‌یاری است.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="5"
//         aria-label=""
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900"> قوانین تحویل طلا </p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               کاربران می‌توانند در هر زمانی، درخواست تحویل طلای خود را از طریق
//               اپلیکیشن بیرگرم ثبت کنند. پس از ثبت درخواست، طی ۲۴ ساعت کاری از
//               خزانه بیرگرم برای هماهنگی تحویل با کاربر تماس گرفته می‌شود. در حال
//               حاضر، تحویل طلا فقط به‌صورت حضوری و در خزانه تحویل فیزیکی بیرگرم
//               در تهران انجام می‌شود.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">2-</span>
//             <span>
//               {" "}
//               حداقل طلای قابل تحویل به کاربر، ۵ گرم است و فقط کاربرانی امکان ثبت
//               درخواست تحویل طلا را دارند که به میزان مورد نیاز، بیرگرم در حساب
//               بیرگرم خود داشته باشند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               در زمان ثبت درخواست، کاربر باید هزینه ضرب، بسته‌بندی و تحویل طلا
//               را که معادل سه درصد از ارزش طلا است، پرداخت کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               در صورت عدم مراجعه کاربر در زمان تعیین شده در درخواست تحویل طلا،
//               درخواست ابطال می‌شود و کاربر باید دوباره مراحل بالا را برای تحویل
//               طلا انجام دهد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span>
//               {" "}
//               در صورت لغو درخواست، هزینه ضرب، بسته‌بندی و تحویل به حساب کاربر
//               بازگردانده خواهد شد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">6-</span>
//             <span>
//               {" "}
//               طلا فقط به شخص کاربر یا وکیل قانونی او تحویل داده می‌شود. هنگام
//               تحویل طلا، به‌همراه داشتن کارت ملی شخص تحویل گیرنده الزامی است.
//               طلای متعلق به اشخاص حقوقی، به نماینده معرفی شده از سوی ایشان تحویل
//               داده خواهد شد. نماینده مذکور هنگام مراجعه برای دریافت طلا، باید
//               علاوه بر مدارک هویتی، روزنامه آخرین تغییرات شخص حقوقی و یک
//               معرفی‌نامه در سربرگ شخص حقوقی (مطابق نمونه موجود در سامانه) که به
//               امضای صاحبان امضای مجاز رسیده باشد، ارائه نماید.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">7-</span>
//             <span>
//               {" "}
//               طلای تحویلی بیرگرم، در قالب شمش طلای ۵ گرمی با نقش طرح بیرگرم
//               ارائه می‌شود. طلای فیزیکی مورد تقاضای شما باید مضرب صحیحی از ۵ گرم
//               باشد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">8-</span>
//             <span>
//               {" "}
//               شمش‌های تحویلی بیرگرم، دارای کد استاندارد یا کد اعتبارسنجی مورد
//               تائید اتحادیه یا اداره استاندارد ایران هستند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">9-</span>
//             <span>
//               {" "}
//               مشتریان در هنگام تحویل گرفتن طلا باید بسته‌بندی را کنترل و از جهت
//               سالم بودن آن اطمینان حاصل نمایند و در صورت مشاهده هرگونه ایراد در
//               بسته بندی (مانند پارگی و…) به متصدی مربوطه اطلاع دهند. کاربر با
//               ارائه کد محرمانه تحویل طلا، صحت مرسوله را تایید نموده است.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">10-</span>
//             <span>
//               {" "}
//               در صورتی که پس از تحویل دادن طلا، پلمپ آن باز شود، هیچگونه
//               مسئولیتی بر عهده سامانه و تحویل دهنده طلا نیست.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="6"
//         aria-label=""
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900">
//               {" "}
//               محدوده موافقت‌نامه و مقررات حاکم بر آن{" "}
//             </p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               تمامی خدماتی که در سامانه بیرگرم در دسترس شما است، توسط شرکت
//               سرمایه زرین ماندگار (سهامی خاص) ارائه می‌شود. شرایط و قوانین ذکر
//               شده در این سند، بر همه بخش‌های رسانه‌ها، سامانه‌ها، خدمات،
//               ابزارها، پشتیبانی‌ها و هر آنچه که در وب سایت، برنامه کاربردی
//               (اپلیکیشن)، شعب، همکاران تجاری و سایر بسترهای متعلق به سامانه و یا
//               همکاران آن وجود دارد، حاکم است.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">2-</span>
//             <span>
//               {" "}
//               با توجه به این که سامانه بیرگرم مطالعه این مقررات را لازمه استفاده
//               از خدمات خود قرار داده، ایجاد حساب کاربری شخصی یا استفاده
//               داوطلبانه شما از هر یک از خدمات سامانه، از جمله ثبت سفارش، به
//               معنای آگاه بودن شما از مقررات راجع به شرایط استفاده از خدمات و
//               حریم خصوصی و پذیرش کامل آن مقررات است.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               مفاد این موافقت‌نامه از زمانی که کاربر برای اولین بار از یکی از
//               خدمات سامانه استفاده می‌کند، تا زمانی که حساب کاربری کاربر در
//               سامانه وجود دارد (خواه حساب کاربری فعال یا غیرفعال باشد) یا کاربر
//               به نحوی از خدمات سامانه استفاده می‌کند، بر رابطه بین او و سامانه
//               حاکم خواهد بود. بدیهی است در صورت لغو یا حذف حساب کاربری، مفاد این
//               موافقت‌نامه بر پیامدهای ناشی از اقدامات انجام شده پیش از این تاریخ
//               حاکم خواهد بود.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               سامانه هر زمان که لازم ببیند می‌تواند شرایط استفاده از خدمات یا
//               ضوابط حریم خصوصی خود را تغییر دهد. در این صورت، تغییرات پیش از
//               اجرایی شدن، از طریق به‌روزرسانی سند حاضر، در همین صفحه منعکس خواهد
//               شد. به علاوه تا حدی که ممکن باشد، در صورتی که کاربر به سامانه
//               اجازه ارسال اعلان (نوتیفیکیشن) داده باشد از همان طریق، وقوع
//               تغییرات به اطلاع کاربر خواهد رسید. در هر حال مسئولیت عدم اطلاع
//               کاربر از تغییراتی که در این صفحه اعلام شده، پس از اجرایی شدن، به
//               عهده کاربر خواهد بود و تداوم استفاده کاربر از خدمات سامانه به
//               معنای آگاهی از این تغییرات و رضایت نسبت به آن‌ها خواهد بود.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span>
//               {" "}
//               عدم اجرای موقت بخشی از شرایط مندرج در این متن نسبت به کاربر یا
//               دیگران، به معنای اسقاط حق اجرای این قوانین از سوی سامانه نسبت به
//               کاربر در آینده نیست.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">6-</span>
//             <span>
//               {" "}
//               بهره‌گیری از برخی از خدمات سامانه، ممکن است علاوه بر مقررات حاضر،
//               مستلزم رعایت ضوابط اختصاصی آن خدمت نیز باشد، که حسب مورد به اطلاع
//               کاربران خواهد رسید.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">7-</span>
//             <span>
//               {" "}
//               کاربر ممکن است به واسطه استفاده از خدمات سامانه، پیشنهاد استفاده
//               از خدمات اشخاص ثالثی را دریافت کند. هم‌چنین ممکن است خدمات سامانه
//               از طریق همکاری با اشخاص ثالث به کاربران ارائه شود. در این موارد،
//               کاربر برای اطلاع از قلمرو تعهدات این اشخاص، از جمله در مورد عدم
//               افشای اطلاعات، باید به مستندات متعلق به خود ایشان مراجعه کند و
//               سامانه بیرگرم جز در موارد تصریح شده، مسئولیتی در این خصوص نخواهد
//               داشت.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="7"
//         aria-label=""
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900"> حساب کاربری </p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               به منظور بهره‌گیری از هر یک از خدمات سامانه میلی، کاربران باید
//               نسبت به تکمیل فرم ثبت‌نام و ایجاد حساب کاربری اقدام کنند. کاربر با
//               ثبت‌نام موافقت می‌کند که اطلاعات دقیق و معتبری از خود ارائه دهد و
//               در صورت هرگونه تغییر، به ویژه تغییر شماره تلفن همراه، این اطلاعات
//               را به‌روزرسانی کند.{" "}
//             </span>
//           </li>
//           <li className="my-4">
//             <span className="font-semibold">
//               {" "}
//               با توجه به اینکه مبادلات مالی و سرمایه گذاری در اپلیکیشن و سامانه
//               میلی انجام می شود، نیازمند ثبت نام و احراز هویت در سامانه میلی است
//               و برای این منظور نیز نیازمند ثبت اطلاعات تماس و اطلاعاتی هویتی
//               دقیق مطابق با اطلاعات ثبت شده در سازمان ثبت احوال کشور است. در
//               میلی اطلاعاتی نظیر شماره تلفن، نام و نام خانوادگی، تاریخ تولد اخذ
//               می شود و همچنین جهت واریز وجه، شماره شبای حساب بانکی مورد تایید
//               کاربر باید در سامانه ثبت شود.{" "}
//             </span>
//           </li>
//           <li>
//             <span className="font-semibold">
//               {" "}
//               تمامی اطلاعاتی که از کاربران میلی دریافت می شود نزد میلی محفوظ است
//               و با هیچ شخص حقیقی یا حقوقی ثالثی به اشتراک گذاشته نمی شود.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">2-</span>
//             <span>
//               {" "}
//               سامانه مجاز است به‌ صورت مستقیم یا با واسطه، اطلاعاتی را که برای
//               تایید هویت کاربر ضروری است، از مراجع قانونی کسب کند. هم‌چنین
//               سامانه این اختیار را دارد که در صورت لزوم برای احراز اهلیت و هویت
//               کاربر یا شناسایی دقیق‌تر وی، مدارک تکمیلی مورد نیاز خویش را از
//               کاربر مطالبه نموده و ادامه خدمت‌رسانی را منوط به ارائه مدارک مورد
//               نیاز نماید. کاربران ملزم به همکاری و ارائه اطلاعات و مدارک مورد
//               نیاز با کمال حسن نیت می‌باشند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               در زمان ثبت نام در سامانه، کاربر باید حداقل ۱۸ سال تمام شمسی داشته
//               باشد و دارای رشد و اهلیت معاملاتی باشد. کاربران نباید محدودیت یا
//               ممنوعیتی در انجام معاملات داشته باشد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               افراد زیر ۱۸ سال باید تحت‌نظر ولی یا قیم قانونی خود و با نمایندگی
//               آنان از خدمات سامانه میلی استفاده کنند، مگر اینکه حکم رشد خود را
//               از مراجع ذی‌صلاح قانونی اخذ نموده و مستندات آن را به سامانه میلی
//               یا نمایندگان رسمی آن ارائه نمایند. در غیر این صورت سامانه هیچ‌گونه
//               مسئولیتی در قبال این اشخاص، اعم از ادامه ارائه خدمات به ایشان یا
//               تحویل طلا به ایشان، نخواهد داشت. به این منظور، کاربران زیر ۱۸ سال
//               می‌بایست رضایت والدین و یا قیم قانونی خود را برای سامانه ارسال
//               نمایند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span>
//               {" "}
//               اشخاص حقوقی که در اداره ثبت شرکت‌ها و مؤسسات غیرتجاری جمهوری
//               اسلامی ایران به ثبت رسیده و دارای وضعیت فعال و معتبر باشند، نیز
//               می‌توانند توسط نماینده خود که دارای اختیارات لازم از سوی شخص حقوقی
//               است، عضو این سامانه شده و از خدمات سامانه استفاده کنند. در صورت
//               لزوم، نامه معرفی نماینده از سوی شخص حقوقی اخذ خواهد شد. در هر حال،
//               اقدامات صورت‌ گرفته از سوی نماینده یا اشخاصی که به حساب کاربری شخص
//               حقوقی دسترسی دارند، به منزله اقدام شخص حقوقی بوده و هرگونه ادعایی
//               از سوی سایر سهام‌داران، مدیران شخص حقوقی و اشخاص ثالث، برخلاف
//               اقدام صورت‌ گرفته توسط نماینده، مسموع نیست.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">6-</span>
//             <span>
//               {" "}
//               کاربر می‌بایست هنگام ثبت‌نام، نام کاربری و رمز عبور برای خود تعیین
//               کند. با انتخاب نام کاربری و رمز عبور و تایید آن توسط سامانه، کاربر
//               به عضویت در سامانه میلی درآمده و مسئولیت تمامی امور انجام‌شده توسط
//               وی در سامانه میلی، به عهده کاربر خواهد بود. هرگونه دسترسی یا
//               استفاده به جز این روش، به معنای تجاوز به حقوق سامانه بوده و پیگرد
//               قانونی دارد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">7-</span>
//             <span>
//               {" "}
//               هر کاربری مسئول حساب کاربری خود و حفظ نام کاربری و رمز عبور خود
//               است و شخصاً مسئولیت هرگونه فعالیت تحت نام کاربری خود را برعهده
//               دارد. هر گونه ادعا از سوی کاربر مبنی بر انجام معامله و ثبت درخواست
//               در حساب کاربری ایشان توسط اشخاص ثالث، مسموع نیست.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">8-</span>
//             <span>
//               {" "}
//               هر شخص صرفاً با اطلاعات هویتی و اطلاعات تماس متعلق به شخص خودش
//               می‌تواند در سامانه میلی ثبت‌نام کند. مسئولیت وارد کردن اطلاعات
//               اشتباه و غیر واقعی در قبال سامانه میلی، مراجع قانونی و قضایی و هر
//               شخص ذی‌نفع (از قبیل مالک حقیقی شماره تلفن ثبت‌شده) به عهده کاربر
//               خواهد بود. سامانه میلی، در صورت مطلع شدن از مغایرت اطلاعات با
//               واقع، حق تعلیق یا لغو عضویت یا مسدود سازی حساب کاربر را خواهد
//               داشت. چنانچه به علت وجود اشتباه یا نقص در اطلاعات ارائه ‌شده توسط
//               کاربر، خللی در ارائه خدمات سامانه به کاربران ایجاد شود، سامانه
//               هیچ‌گونه مسئولیتی ندارد و کاربر مسئول جبران خسارات احتمالی وارده
//               به سامانه، سایر کاربران سامانه و اشخاص ثالث است.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">9-</span>
//             <span>
//               {" "}
//               با توجه به اینکه نام کاربری افراد، شماره تلفن همراه ایشان است و
//               همچنین با توجه به اینکه بازیابی رمز عبور از طریق سیم کارت انجام
//               می‌شود، کاربر باید پیش از انتقال یا فروش سیم کارت، نسبت به تغییر
//               شماره تماس خود در سامانه اقدام نماید. در صورت عدم اقدام به تغییر
//               شماره همراه ممکن است لازم باشد کاربر برای بازیابی رمز عبور، فرایند
//               احراز هویت غیرحضوری سامانه را طی نماید. پرداخت هزینه‌های احتمالی
//               احراز هویت غیر حضوری بر عهده کاربر است.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">10-</span>
//             <span>
//               {" "}
//               سامانه می‌تواند سطح خدمات قابل ارائه به هر کاربر را متناسب با
//               عواملی مانند سطح احراز هویت و حجم معاملات کاربر، شخصی‌سازی نماید.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">11-</span>
//             <span>
//               {" "}
//               استفاده از برخی از خدمات سامانه مستلزم احراز هویت غیرحضوری کاربر
//               خواهد بود. در این موارد، لینک احراز هویت در زمان ارائه درخواست
//               خدمت در اختیار کاربر قرار خواهد گرفت. هم‌چنین برای استفاده از برخی
//               از خدمات سامانه، کاربر باید یک حساب بانکی به نام خود در یکی از
//               بانک‌های جمهوری اسلامی ایران یا بانک معرفی شده از سوی سامانه،
//               معرفی کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">12-</span>
//             <span>
//               {" "}
//               انتقال حساب کاربری یا حقوق و تعهدات ناشی از آن به هر شخص حقیقی یا
//               حقوقی ثالث یا اعطای نمایندگی در بهره‌برداری از آن، به جز آن چه در
//               این سند اجازه داده شده است، ممنوع است و کاربر مسئول تمامی عواقب و
//               خسارات ناشی از این انتقال یا اعطای نمایندگی خواهد بود.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">13-</span>
//             <span>
//               {" "}
//               كاربر در هر زمان می‌تواند درخواست لغو عضویت در سامانه را بدهد. در
//               صورت صفر بودن موجودی کیف پول ریالی و کیف پول طلای کاربر، سامانه
//               حساب کاربر مورد نظر را غیرفعال می‌کند، در غیر این صورت ابتدا کاربر
//               باید نسبت به صفر کردن موجودی حساب میلی خود (از طریق انتقال موجودی
//               حساب میلی خود به سایر کاربران و یا فروش میلی و یا دریافت طلا)
//               اقدام نماید و سپس درخواست لغو عضویت را ثبت کند. اطلاعات حساب‌های
//               کاربری لغو شده، لزوما از پایگاه داده‌های سامانه پاک نخواهد شد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">14-</span>
//             <span>
//               {" "}
//               با لغو حساب کاربری، کاربر دیگر امکان معامله در سامانه را نخواهد
//               داشت. پس از لغو حساب کاربری توسط کاربر، کاربر در هر زمان می‌تواند
//               نسبت به ایجاد حساب کاربری جدید اقدام کند.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="8"
//         aria-label=""
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900">حقوق و تعهدات کاربر</p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               پس از ثبت نهایی خرید یا فروش، پردازش آن در سامانه و پرداخت وجه آن
//               (یا کسر شدن موجودی از کیف پول ریالی یا حساب میلی کاربر)، کاربر
//               امکان لغو یا ویرایش سفارش را ندارد. کاربران هرگونه حق فسخ معاملات
//               را از خود سلب و ساقط می‌کنند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li className="my-4">
//             <span className=" text-blue-900 text-lg">2-</span>
//             <span className="">
//               {" "}
//               قیمت میلی تابعی از قیمت طلا است و مسئولیت سرمایه‌گذاری و خرید و
//               فروش کاربران در حوزه طلا بر عهده کاربر بوده و در خصوص نوسانات
//               قیمت، یا سود و زیان احتمالی ناشی از معاملات، سامانه هیچ‌گونه دخل و
//               تصرف و مسئولیتی ندارد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               در صورت فوت کاربر، وراث قانونی وی یا وکلای قانونی ایشان می توانند
//               متفقا با ارائه مستندات قانونی (از جمله گواهی انحصار وراثت و اسناد
//               هویتی خود) نسبت به ثبت درخواست برداشت موجودی حساب میلی یا تحویل
//               گرفتن طلا و یا دریافت موجودی کیف پول ریالی کاربر متوفی، اقدام
//               کنند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               کاربر متعهد است هیچ‌گاه از خدمات سامانه به صورتی که به سامانه یا
//               به سایر کاربران آن صدمه‌ای وارد کند، استفاده نکند. در صورت سوء
//               استفاده کاربر از امکانات سامانه به نحوی که خارج از حدود انتفاع
//               مقرر بوده یا موجب آسیب مادی یا معنوی به منافع سامانه یا اشخاص ثالث
//               گردد، سامانه حق قطع خدمات و محدود یا مسدود سازی دسترسی و نیز حق
//               مراجعه به مراجع ذیصلاح و اقدام نسبت به پیگیری قانونی از جمله
//               مطالبه خسارات وارده را خواهد داشت.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span>
//               {" "}
//               کاربر اذعان و اقرار می‌نماید که علامت تجاری «میلی»، نام دامنه،
//               طراحی‌های سایت، سایر طرح‌ها و حقوق مالکیت فکری مندرج در سایت متعلق
//               به سامانه بوده و حق هرگونه ادعا در این خصوص یا بهره‌برداری غیرمجاز
//               را از خود سلب می‌نماید.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">6-</span>
//             <span>
//               {" "}
//               کاربر می‌پذیرد صرفاً از حساب بانکی متعلق به خود اقدام به پرداخت
//               وجه و شارژ کیف پول ريالی خود نماید. در صورتی که خلاف این امر کشف
//               گردد، علاوه بر این که کاربر مسئول جبران خسارات وارده به سامانه و
//               سایر اشخاص خواهد بود، سامانه می‌تواند معاملات انجام شده با استفاده
//               از حساب بانکی متعلق به اشخاص دیگر را ابطال کند یا از انجام چنین
//               معاملاتی جلوگیری کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">7-</span>
//             <span>
//               {" "}
//               کاربر می‌پذیرد که سامانه از پیامک و ارسال اطلاعیه در برنامه
//               کاربردی (push notification) به عنوان راه ارتباطی با کاربران جهت
//               ارسال مطالب و موضوعات مرتبط استفاده خواهد کرد. کاربر ضمن اعلام
//               رضایت خود از این موضوع، متعهد به چک کردن منظم راه‌های ارتباطی جهت
//               دریافت فوری اطلاعیه‌ها است و به محض ارسال اطلاعیه از هر یک از
//               راه‌های یادشده، محتوای آن اطلاعیه ابلاغ‌شده تلقی خواهد شد.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">8-</span>
//             <span>
//               {" "}
//               مسئولیت هرگونه خسارت احتمالی ناشی از عدم توجه کاربر به ضوابط مشروح
//               در این موافقت‌نامه، با کاربر خواهد بود.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="9"
//         aria-label=""
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900"> امنیت و محرمانگی </p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               حفاظت از اطلاعات شخصی کاربران، از جمله اصول اساسی و مهم اخلاقی و
//               حرفه‌ای سامانه میلی به شمار می‌رود. سامانه با اتخاذ تدابیر امنیتی
//               متعارف، امنیت پایه زیرساخت‌ها و خدمات خود را تأمین می‌کند و با
//               بهره‌گیری از روش‌های مطلوب مدیریت داده، در حد متعارف از افشای
//               اطلاعات کاربران جلوگیری می‌کند. با این حال سامانه نسبت به اموری که
//               به طور متعارف در حیطه مسئولیت خود کاربر از لحاظ نگهداری امنیت حساب
//               کاربری اوست، یا اموری که کنترل آن بنا به معیارهای متعارف از حیطه
//               کنترل سامانه خارج است، مسئولیتی نخواهد داشت.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li className="my-4">
//             <span className=" text-blue-900 text-lg">2-</span>
//             <span> سامانه نسبت به موارد زیر مسئولیتی نخواهد داشت </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               ضعف ایمنی سخت‌افزارهای مورد استفاده کاربر برای ارتباط با سامانه{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               استفاده کاربر از نسخه‌های غیر معتبر سامانه و یا نسخه‌های غیر معتبر
//               برنامه کاربردی (اپلیکیشن) سامانه میلی{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span> در اختیار گرفتن کلمه عبور حساب کاربری توسط اشخاص ثالث </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">6-</span>
//             <span>
//               {" "}
//               سامانه صرفاً در صورتی و در زمانی، اطلاعات شخصی کاربران را درخواست
//               یا این اطلاعات را جمع‌آوری و پردازش می‌کند که برای ارائه خدمات یا
//               ارائه بهتر خدمات به ایشان، ضروری باشد. واگذاری اطلاعات از سوی
//               کاربر به این معناست که حسب مورد اجازه پردازش یا ذخیره‌سازی آن‌ها
//               را نیز به سامانه داده است و سامانه می‌تواند با گمنام سازی این
//               اطلاعات، از آن‌ها برای مقاصدی مانند تهیه و انتشار گزارش، تحلیل‌های
//               آماری، تهیه بروشور و غیره استفاده کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">7-</span>
//             <span>
//               {" "}
//               کاربران حق هیچ‌گونه تلاش در جهت استخراج سورس کد سامانه، ارائه نسخه
//               ثانوی از سامانه روی سرورهای دیگر، ایجاد تغییر یا اخلال در سامانه،
//               اجرای نرم‌افزار یا اسکریپتی جهت ایندکس‌گذاری، مطالعه یا هرگونه
//               داده‌کاوی بر روی سامانه، یا دسترسی غیر متداول و غیر قانونی به هر
//               یک از قسمت‌های آن را ندارند و هر اقدامی جهت هر یک از این موارد
//               تخلف محسوب شده و ناقض حقوق سامانه میلی خواهد بود. در چنین مواردی
//               سامانه می‌تواند علاوه بر پیگرد قضایی موضوع، حسب مورد حساب کاربری
//               کاربر متخلف را به صورت موقت یا دائم محدود، مسدود یا معلق کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">8-</span>
//             <span>
//               {" "}
//               سامانه اطلاعات شخصی کاربر را بدون اذن و اجازه، در اختیار اشخاص
//               ثالث قرار نخواهد داد، مگر در مواردی که قانون ارائه آن‌ها را به
//               مراجع ذی‌صلاح الزامی شمرده یا به دستور مقام قضایی، ضابطان دادگستری
//               یا مراجع قانونی، این اطلاعات می‌بایست در اختیار سایرین قرار گیرد.
//               در این موارد نیز صرفاً نسبت به ارائه اطلاعاتی که مورد استعلام یا
//               درخواست بوده، اکتفا خواهد شد.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="10"
//         aria-label=""
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900"> تعلیق و قطع دسترسی </p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               حفاظت از اطلاعات شخصی کاربران، از جمله اصول اساسی و مهم اخلاقی و
//               حرفه‌ای سامانه میلی به شمار می‌رود. سامانه با اتخاذ تدابیر امنیتی
//               متعارف، امنیت پایه زیرساخت‌ها و خدمات خود را تأمین می‌کند و با
//               بهره‌گیری از روش‌های مطلوب مدیریت داده، در حد متعارف از افشای
//               اطلاعات کاربران جلوگیری می‌کند. با این حال سامانه نسبت به اموری که
//               به طور متعارف در حیطه مسئولیت خود کاربر از لحاظ نگهداری امنیت حساب
//               کاربری اوست، یا اموری که کنترل آن بنا به معیارهای متعارف از حیطه
//               کنترل سامانه خارج است، مسئولیتی نخواهد داشت.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li className="my-4">
//             <span className=" text-blue-900 text-lg">2-</span>
//             <span> سامانه نسبت به موارد زیر مسئولیتی نخواهد داشت </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               ضعف ایمنی سخت‌افزارهای مورد استفاده کاربر برای ارتباط با سامانه{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               استفاده کاربر از نسخه‌های غیر معتبر سامانه و یا نسخه‌های غیر معتبر
//               برنامه کاربردی (اپلیکیشن) سامانه میلی{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span> در اختیار گرفتن کلمه عبور حساب کاربری توسط اشخاص ثالث </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">6-</span>
//             <span>
//               {" "}
//               سامانه صرفاً در صورتی و در زمانی، اطلاعات شخصی کاربران را درخواست
//               یا این اطلاعات را جمع‌آوری و پردازش می‌کند که برای ارائه خدمات یا
//               ارائه بهتر خدمات به ایشان، ضروری باشد. واگذاری اطلاعات از سوی
//               کاربر به این معناست که حسب مورد اجازه پردازش یا ذخیره‌سازی آن‌ها
//               را نیز به سامانه داده است و سامانه می‌تواند با گمنام سازی این
//               اطلاعات، از آن‌ها برای مقاصدی مانند تهیه و انتشار گزارش، تحلیل‌های
//               آماری، تهیه بروشور و غیره استفاده کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">7-</span>
//             <span>
//               {" "}
//               کاربران حق هیچ‌گونه تلاش در جهت استخراج سورس کد سامانه، ارائه نسخه
//               ثانوی از سامانه روی سرورهای دیگر، ایجاد تغییر یا اخلال در سامانه،
//               اجرای نرم‌افزار یا اسکریپتی جهت ایندکس‌گذاری، مطالعه یا هرگونه
//               داده‌کاوی بر روی سامانه، یا دسترسی غیر متداول و غیر قانونی به هر
//               یک از قسمت‌های آن را ندارند و هر اقدامی جهت هر یک از این موارد
//               تخلف محسوب شده و ناقض حقوق سامانه میلی خواهد بود. در چنین مواردی
//               سامانه می‌تواند علاوه بر پیگرد قضایی موضوع، حسب مورد حساب کاربری
//               کاربر متخلف را به صورت موقت یا دائم محدود، مسدود یا معلق کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">8-</span>
//             <span>
//               {" "}
//               سامانه اطلاعات شخصی کاربر را بدون اذن و اجازه، در اختیار اشخاص
//               ثالث قرار نخواهد داد، مگر در مواردی که قانون ارائه آن‌ها را به
//               مراجع ذی‌صلاح الزامی شمرده یا به دستور مقام قضایی، ضابطان دادگستری
//               یا مراجع قانونی، این اطلاعات می‌بایست در اختیار سایرین قرار گیرد.
//               در این موارد نیز صرفاً نسبت به ارائه اطلاعاتی که مورد استعلام یا
//               درخواست بوده، اکتفا خواهد شد.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="11"
//         aria-label=""
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900"> قانون حاکم و شیوه حل و فصل اختلاف</p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               حفاظت از اطلاعات شخصی کاربران، از جمله اصول اساسی و مهم اخلاقی و
//               حرفه‌ای سامانه میلی به شمار می‌رود. سامانه با اتخاذ تدابیر امنیتی
//               متعارف، امنیت پایه زیرساخت‌ها و خدمات خود را تأمین می‌کند و با
//               بهره‌گیری از روش‌های مطلوب مدیریت داده، در حد متعارف از افشای
//               اطلاعات کاربران جلوگیری می‌کند. با این حال سامانه نسبت به اموری که
//               به طور متعارف در حیطه مسئولیت خود کاربر از لحاظ نگهداری امنیت حساب
//               کاربری اوست، یا اموری که کنترل آن بنا به معیارهای متعارف از حیطه
//               کنترل سامانه خارج است، مسئولیتی نخواهد داشت.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li className="my-4">
//             <span className=" text-blue-900 text-lg">2-</span>
//             <span> سامانه نسبت به موارد زیر مسئولیتی نخواهد داشت </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               ضعف ایمنی سخت‌افزارهای مورد استفاده کاربر برای ارتباط با سامانه{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               استفاده کاربر از نسخه‌های غیر معتبر سامانه و یا نسخه‌های غیر معتبر
//               برنامه کاربردی (اپلیکیشن) سامانه میلی{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span> در اختیار گرفتن کلمه عبور حساب کاربری توسط اشخاص ثالث </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">6-</span>
//             <span>
//               {" "}
//               سامانه صرفاً در صورتی و در زمانی، اطلاعات شخصی کاربران را درخواست
//               یا این اطلاعات را جمع‌آوری و پردازش می‌کند که برای ارائه خدمات یا
//               ارائه بهتر خدمات به ایشان، ضروری باشد. واگذاری اطلاعات از سوی
//               کاربر به این معناست که حسب مورد اجازه پردازش یا ذخیره‌سازی آن‌ها
//               را نیز به سامانه داده است و سامانه می‌تواند با گمنام سازی این
//               اطلاعات، از آن‌ها برای مقاصدی مانند تهیه و انتشار گزارش، تحلیل‌های
//               آماری، تهیه بروشور و غیره استفاده کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">7-</span>
//             <span>
//               {" "}
//               کاربران حق هیچ‌گونه تلاش در جهت استخراج سورس کد سامانه، ارائه نسخه
//               ثانوی از سامانه روی سرورهای دیگر، ایجاد تغییر یا اخلال در سامانه،
//               اجرای نرم‌افزار یا اسکریپتی جهت ایندکس‌گذاری، مطالعه یا هرگونه
//               داده‌کاوی بر روی سامانه، یا دسترسی غیر متداول و غیر قانونی به هر
//               یک از قسمت‌های آن را ندارند و هر اقدامی جهت هر یک از این موارد
//               تخلف محسوب شده و ناقض حقوق سامانه میلی خواهد بود. در چنین مواردی
//               سامانه می‌تواند علاوه بر پیگرد قضایی موضوع، حسب مورد حساب کاربری
//               کاربر متخلف را به صورت موقت یا دائم محدود، مسدود یا معلق کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">8-</span>
//             <span>
//               {" "}
//               سامانه اطلاعات شخصی کاربر را بدون اذن و اجازه، در اختیار اشخاص
//               ثالث قرار نخواهد داد، مگر در مواردی که قانون ارائه آن‌ها را به
//               مراجع ذی‌صلاح الزامی شمرده یا به دستور مقام قضایی، ضابطان دادگستری
//               یا مراجع قانونی، این اطلاعات می‌بایست در اختیار سایرین قرار گیرد.
//               در این موارد نیز صرفاً نسبت به ارائه اطلاعاتی که مورد استعلام یا
//               درخواست بوده، اکتفا خواهد شد.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="12"
//         aria-label=""
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900"> حد مسئولیت سامانه</p>
//             <p className="text-yellow-400"> بیرگرم</p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               حفاظت از اطلاعات شخصی کاربران، از جمله اصول اساسی و مهم اخلاقی و
//               حرفه‌ای سامانه میلی به شمار می‌رود. سامانه با اتخاذ تدابیر امنیتی
//               متعارف، امنیت پایه زیرساخت‌ها و خدمات خود را تأمین می‌کند و با
//               بهره‌گیری از روش‌های مطلوب مدیریت داده، در حد متعارف از افشای
//               اطلاعات کاربران جلوگیری می‌کند. با این حال سامانه نسبت به اموری که
//               به طور متعارف در حیطه مسئولیت خود کاربر از لحاظ نگهداری امنیت حساب
//               کاربری اوست، یا اموری که کنترل آن بنا به معیارهای متعارف از حیطه
//               کنترل سامانه خارج است، مسئولیتی نخواهد داشت.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li className="my-4">
//             <span className=" text-blue-900 text-lg">2-</span>
//             <span> سامانه نسبت به موارد زیر مسئولیتی نخواهد داشت </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               ضعف ایمنی سخت‌افزارهای مورد استفاده کاربر برای ارتباط با سامانه{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               استفاده کاربر از نسخه‌های غیر معتبر سامانه و یا نسخه‌های غیر معتبر
//               برنامه کاربردی (اپلیکیشن) سامانه میلی{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span> در اختیار گرفتن کلمه عبور حساب کاربری توسط اشخاص ثالث </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">6-</span>
//             <span>
//               {" "}
//               سامانه صرفاً در صورتی و در زمانی، اطلاعات شخصی کاربران را درخواست
//               یا این اطلاعات را جمع‌آوری و پردازش می‌کند که برای ارائه خدمات یا
//               ارائه بهتر خدمات به ایشان، ضروری باشد. واگذاری اطلاعات از سوی
//               کاربر به این معناست که حسب مورد اجازه پردازش یا ذخیره‌سازی آن‌ها
//               را نیز به سامانه داده است و سامانه می‌تواند با گمنام سازی این
//               اطلاعات، از آن‌ها برای مقاصدی مانند تهیه و انتشار گزارش، تحلیل‌های
//               آماری، تهیه بروشور و غیره استفاده کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">7-</span>
//             <span>
//               {" "}
//               کاربران حق هیچ‌گونه تلاش در جهت استخراج سورس کد سامانه، ارائه نسخه
//               ثانوی از سامانه روی سرورهای دیگر، ایجاد تغییر یا اخلال در سامانه،
//               اجرای نرم‌افزار یا اسکریپتی جهت ایندکس‌گذاری، مطالعه یا هرگونه
//               داده‌کاوی بر روی سامانه، یا دسترسی غیر متداول و غیر قانونی به هر
//               یک از قسمت‌های آن را ندارند و هر اقدامی جهت هر یک از این موارد
//               تخلف محسوب شده و ناقض حقوق سامانه میلی خواهد بود. در چنین مواردی
//               سامانه می‌تواند علاوه بر پیگرد قضایی موضوع، حسب مورد حساب کاربری
//               کاربر متخلف را به صورت موقت یا دائم محدود، مسدود یا معلق کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">8-</span>
//             <span>
//               {" "}
//               سامانه اطلاعات شخصی کاربر را بدون اذن و اجازه، در اختیار اشخاص
//               ثالث قرار نخواهد داد، مگر در مواردی که قانون ارائه آن‌ها را به
//               مراجع ذی‌صلاح الزامی شمرده یا به دستور مقام قضایی، ضابطان دادگستری
//               یا مراجع قانونی، این اطلاعات می‌بایست در اختیار سایرین قرار گیرد.
//               در این موارد نیز صرفاً نسبت به ارائه اطلاعاتی که مورد استعلام یا
//               درخواست بوده، اکتفا خواهد شد.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//       <AccordionItem
//         key="13"
//         aria-label=""
//         title={
//           <div className="flex text-lg font-semibold gap-1">
//             <p className="text-blue-900"> پشتیبانی</p>
//             <p className="text-yellow-400"> بیرگرم</p>
//           </div>
//         }
//       >
//         <ul className="text-sm">
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">1-</span>
//             <span>
//               {" "}
//               حفاظت از اطلاعات شخصی کاربران، از جمله اصول اساسی و مهم اخلاقی و
//               حرفه‌ای سامانه میلی به شمار می‌رود. سامانه با اتخاذ تدابیر امنیتی
//               متعارف، امنیت پایه زیرساخت‌ها و خدمات خود را تأمین می‌کند و با
//               بهره‌گیری از روش‌های مطلوب مدیریت داده، در حد متعارف از افشای
//               اطلاعات کاربران جلوگیری می‌کند. با این حال سامانه نسبت به اموری که
//               به طور متعارف در حیطه مسئولیت خود کاربر از لحاظ نگهداری امنیت حساب
//               کاربری اوست، یا اموری که کنترل آن بنا به معیارهای متعارف از حیطه
//               کنترل سامانه خارج است، مسئولیتی نخواهد داشت.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li className="my-4">
//             <span className=" text-blue-900 text-lg">2-</span>
//             <span> سامانه نسبت به موارد زیر مسئولیتی نخواهد داشت </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="text-blue-900 text-lg">3-</span>
//             <span>
//               {" "}
//               ضعف ایمنی سخت‌افزارهای مورد استفاده کاربر برای ارتباط با سامانه{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">4-</span>
//             <span>
//               {" "}
//               استفاده کاربر از نسخه‌های غیر معتبر سامانه و یا نسخه‌های غیر معتبر
//               برنامه کاربردی (اپلیکیشن) سامانه میلی{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">5-</span>
//             <span> در اختیار گرفتن کلمه عبور حساب کاربری توسط اشخاص ثالث </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">6-</span>
//             <span>
//               {" "}
//               سامانه صرفاً در صورتی و در زمانی، اطلاعات شخصی کاربران را درخواست
//               یا این اطلاعات را جمع‌آوری و پردازش می‌کند که برای ارائه خدمات یا
//               ارائه بهتر خدمات به ایشان، ضروری باشد. واگذاری اطلاعات از سوی
//               کاربر به این معناست که حسب مورد اجازه پردازش یا ذخیره‌سازی آن‌ها
//               را نیز به سامانه داده است و سامانه می‌تواند با گمنام سازی این
//               اطلاعات، از آن‌ها برای مقاصدی مانند تهیه و انتشار گزارش، تحلیل‌های
//               آماری، تهیه بروشور و غیره استفاده کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">7-</span>
//             <span>
//               {" "}
//               کاربران حق هیچ‌گونه تلاش در جهت استخراج سورس کد سامانه، ارائه نسخه
//               ثانوی از سامانه روی سرورهای دیگر، ایجاد تغییر یا اخلال در سامانه،
//               اجرای نرم‌افزار یا اسکریپتی جهت ایندکس‌گذاری، مطالعه یا هرگونه
//               داده‌کاوی بر روی سامانه، یا دسترسی غیر متداول و غیر قانونی به هر
//               یک از قسمت‌های آن را ندارند و هر اقدامی جهت هر یک از این موارد
//               تخلف محسوب شده و ناقض حقوق سامانه میلی خواهد بود. در چنین مواردی
//               سامانه می‌تواند علاوه بر پیگرد قضایی موضوع، حسب مورد حساب کاربری
//               کاربر متخلف را به صورت موقت یا دائم محدود، مسدود یا معلق کند.{" "}
//             </span>
//           </li>
//           <Divider className="my-5" />
//           <li>
//             <span className="font-semibold text-blue-900 text-lg">8-</span>
//             <span>
//               {" "}
//               سامانه اطلاعات شخصی کاربر را بدون اذن و اجازه، در اختیار اشخاص
//               ثالث قرار نخواهد داد، مگر در مواردی که قانون ارائه آن‌ها را به
//               مراجع ذی‌صلاح الزامی شمرده یا به دستور مقام قضایی، ضابطان دادگستری
//               یا مراجع قانونی، این اطلاعات می‌بایست در اختیار سایرین قرار گیرد.
//               در این موارد نیز صرفاً نسبت به ارائه اطلاعاتی که مورد استعلام یا
//               درخواست بوده، اکتفا خواهد شد.{" "}
//             </span>
//           </li>
//         </ul>
//       </AccordionItem>
//     </Accordion>
//   );
// }

// export default BirgeramRules;

"use client";
import React, { useEffect, useState } from "react";
import { Accordion, AccordionItem, Divider } from "@nextui-org/react";
import Image from "next/image";
import Link from "next/link";

const BirgeramRules = () => {
  const [rulesData, setRulesData] = useState(null);

  useEffect(() => {
    // Fetch or import the JSON data
    const fetchData = async () => {
      const response = await fetch("/birRules.json");
      const data = await response.json();
      setRulesData(data);
    };

    fetchData();
  }, []);

  if (!rulesData) return <div>Loading...</div>;

  return (
    <Accordion variant="splitted">
      {rulesData.sections.map((section) => (
        <AccordionItem
          key={section.id}
          title={
            <div className="flex text-lg font-semibold gap-1">
              <p className="text-blue-900">{section.title.text1}</p>
              <p className="text-yellow-400">{section.title.text2}</p>
            </div>
          }
        >
          <ul className="text-sm">
            {section.content.map((item, index) => (
              <li key={index}>
                {item.label && (
                  <span className="font-semibold text-blue-900">
                    {item.label}
                  </span>
                )}
                {item.text && <span>{item.text}</span>}
                {item.type === "formula" && (
                  <div className="bg-blue-100 text-blue-400 flex gap-3 p-3 rounded-lg mt-2">
                    <Image
                      width={24}
                      height={24}
                      src="/icons/rules/info.svg"
                      alt="info"
                    />
                    <p>{item.formula}</p>
                  </div>
                )}
                <Divider className="my-5" />
              </li>
            ))}
          </ul>
        </AccordionItem>
      ))}
    </Accordion>
  );
};

export default BirgeramRules;
